[
    {
        "name": "Alien",
        "description": "Tool has a random bonus to Durability, Speed, and Attack that slowly takes effect over time."
    },
    {
        "name": "Aquadynamic",
        "description": "Speed boost while underwater or it is raining. Underwater, tool will mine at normal speed."
    },
    {
        "name": "Aridiculous",
        "description": "Mine faster and inflict more damage when it is hot and dry. If it is only dry, take a slight penalty instead."
    },
    {
        "name": "Autosmelt",
        "description": "Items mined with this tool are smelted as if in a Furnace."
    },
    {
        "name": "Baconlicious",
        "description": "5% chance to drop bacon when killing mobs, 0.5% chance when breaking blocks."
    },
    {
        "name": "Beheading",
        "description": "Each level adds a 10% chance to get the enemies head on kill. Beheading II is applied to cleavers by default when constructed."
    },
    {
        "name": "Breakable",
        "description": "Arrows have a chance to break and cannot be retrieved."
    },
    {
        "name": "Cheap",
        "description": "Tool gains an additional 5% to restored durability when repaired."
    },
    {
        "name": "Cheapskate",
        "description": "Tool is 20% less durable than the stats of its components would suggest."
    },
    {
        "name": "Cold-Blooded",
        "description": "50% extra damage if the target is at full health."
    },
    {
        "name": "Crude",
        "description": "5% extra damage against unarmoured targets."
    },
    {
        "name": "Crude II",
        "description": "10% extra damage against unarmoured targets."
    },
    {
        "name": "Crumbling",
        "description": "Double mining speed if the block doesn't require a tool to break."
    },
    {
        "name": "Dense",
        "description": "Reduced chance of using durability if the tool is already damaged."
    },
    {
        "name": "Depth Digger",
        "description": "Digs faster the lower the player is (approximately 1.03x faster per level below y=72)."
    },
    {
        "name": "Duritae",
        "description": "Each time the tool is used, 10% chance of using double durability, 40% chance to use none."
    },
    {
        "name": "Ecological",
        "description": "1 in 800 chance of repairing a point of durability every tick."
    },
    {
        "name": "Enderference",
        "description": "Endermen cannot teleport away for a few seconds after being damaged."
    },
    {
        "name": "Endspeed",
        "description": "Arrows travel instantly to where the player is aiming; no travel time."
    },
    {
        "name": "Fire Storm",
        "description": "Bonus fire damage and sets hit mobs on fire."
    },
    {
        "name": "Flammable",
        "description": "Blocking with this weapon sets attackers on fire and prevents the player from being damaged by fiery attacks."
    },
    { "name": "Fractured", "description": "Deals 1.5 Hearts of bonus damage." },
    {
        "name": "Freezing",
        "description": "Mob moves slower and slower the more they are hit."
    },
    {
        "name": "Hellish",
        "description": "Deals 2 Hearts of bonus damage to Mobs that do not usually spawn in the Nether."
    },
    {
        "name": "Holy",
        "description": "Deals 3 Hearts of bonus damage to undead enemies."
    },
    {
        "name": "Hovering",
        "description": "Arrow moves slower but ignores gravity."
    },
    {
        "name": "Insatiable",
        "description": "Hits after the first will deal progressively more bonus damage but also consume more and more durability."
    },
    {
        "name": "Jagged",
        "description": "Tool does more damage as it loses durability, but mines slower."
    },
    {
        "name": "Lightweight",
        "description": "10% bonus mining speed and attack speed."
    },
    {
        "name": "Magnetic",
        "description": "Item drops are drawn to the player."
    },
    {
        "name": "Magnetic II",
        "description": "Item drops are drawn to the player at a wider range than Magnetic."
    },
    {
        "name": "Momentum",
        "description": "Mining blocks increases the player's speed as long as they keep mining."
    },
    {
        "name": "Petramor",
        "description": "When mining stone, there is a 10% chance to repair some durability."
    },
    {
        "name": "Poisonous",
        "description": "Poison is inflicted on target when hit."
    },
    {
        "name": "Precipitate",
        "description": "Tool speed is inversely proportional to remaining player health."
    },
    {
        "name": "Prickly",
        "description": "Enemy sustains an additional 0.5 to 1.5 hearts of armor-penetrating damage when hit."
    },
    {
        "name": "Sharp",
        "description": "Inflicts bleeding status effect on an enemy when hit, inflicting 0.5 hearts of damage per second for a few seconds."
    },
    {
        "name": "Shocking",
        "description": "Running around, breaking blocks, or hitting things charges the player's tool. Hitting an enemy discharges it, dealing damage and providing a speed boost. Mining a block discharges it, giving a mining speed boost."
    },
    {
        "name": "Slimey (Green)",
        "description": "Tool has a chance to spawn a green slime."
    },
    {
        "name": "Slimey (Blue)",
        "description": "Tool has a chance to spawn a blue slime."
    },
    {
        "name": "Spiky",
        "description": "Upon being hit, inflict 1/3 of the tool's damage value to the enemy as cactus damage. There is a short cooldown before the effect occurs again."
    },
    {
        "name": "Splintering",
        "description": "Successive hits on the same mob inflicts more damage."
    },
    {
        "name": "Splitting",
        "description": "Chance to fire 2 arrows instead of 1 upon firing. 2nd arrow does not have 100% accuracy."
    },
    {
        "name": "Squeaky",
        "description": "Grants Silk Touch but negates all damage."
    },
    {
        "name": "Stiff",
        "description": "Reduces damage to a maximum of 1 heart of damage when blocking."
    },
    {
        "name": "Stalwart",
        "description": "Hitting an entity can bestow Resistance for 30 seconds."
    },
    {
        "name": "Stonebound",
        "description": "Tool mines faster as it loses durability, but inflicts less damage."
    },
    {
        "name": "Superheat",
        "description": "Deal bonus damage to enemies on fire."
    },
    {
        "name": "Tasty",
        "description": "Tool has a chance to drop food when hitting a mob"
    },
    {
        "name": "Twilit",
        "description": "Tool operates faster in the Twilight Forest; it inflicts more damage outside the Twilight Forest."
    },
    {
        "name": "Unnatural",
        "description": "The tool mines faster the higher its mining level is above the required one."
    },
    {
        "name": "Well-Established",
        "description": "Slightly increased XP drop rate, and XP drops are larger."
    },
    { "name": "Writable", "description": "+1 modifier slot." },
    { "name": "Writable II", "description": "+2 modifier slots." },
    { "name": "Veiled", "description": "Projectile will be invisible" }
]
